setExtractRCMode -engine postRoute
setExtractRCMode -effortLevel medium
extractRC
timeDesign -postRoute
timeDesign -postRoute -hold
