# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name typ_rc -cap_table {../virtuoso/qrc/typical/captables/typ.capTbl} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0} -postRoute_cap {1.0} -postRoute_xcap {1.0} -postRoute_clkres {0.0} -postRoute_clkcap {0.0}
create_library_set -name typ_liberty -timing {../liberty/KISTA_SOI_STDLIB2_ECSM_TT.lib}
create_constraint_mode -name functional_mode -sdc_files {../genus/genus_output/design.sdc}
create_delay_corner -name typ_corner -library_set {typ_liberty} -rc_corner {typ_rc}
create_analysis_view -name typ_functional_mode -constraint_mode {functional_mode} -delay_corner {typ_corner}
set_analysis_view -setup {typ_functional_mode} -hold {typ_functional_mode}

